In [1]:
%load_ext sql
%env DATABASE_URL=postgresql://postgres:pwd@localhost:5432/retail_db
%sql SELECT current_database()

env: DATABASE_URL=postgresql://postgres:pwd@localhost:5432/retail_db
1 rows affected.

[('retail_db',)]

In [3]:
%sql SELECT * FROM orders LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

In [4]:
%sql SELECT * FROM order_items LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99),
 (6, 4, 365, 5, 299.95, 59.99),
 (7, 4, 502, 3, 150.0, 50.0),
 (8, 4, 1014, 4, 199.92, 49.98),
 (9, 5, 957, 1, 299.98, 299.98),
 (10, 5, 365, 5, 299.95, 59.99)]

In [5]:
%sql SELECT * FROM products LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, 2, 'Quest Q64 10 FT. x 10 FT. Slant Leg Instant U', '', 59.98, 'http://images.acmesports.sports/Quest+Q64+10+FT.+x+10+FT.+Slant+Leg+Instant+Up+Canopy'),
 (2, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat'),
 (3, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat'),
 (4, 2, "Under Armour Men's Renegade D Mid Football Cl", '', 89.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Renegade+D+Mid+Football+Cleat'),
 (5, 2, 'Riddell Youth Revolution Speed Custom Footbal', '', 199.99, 'http://images.acmesports.sports/Riddell+Youth+Revolution+Speed+Custom+Football+Helmet'),
 (6, 2, "Jordan Men's VI Retro TD Football Cleat", '', 134.99, 'http://images.acmesports.sports/Jordan+Men%27s+VI+Retro+TD+Football+Cleat'),
 (7, 2, 'Schutt Youth Recruit Hybrid Custom Football H', '', 99.99, 'http://images.acmesports.sports/Schutt+Youth+Recruit+Hybrid+Custom+Football+Helmet+2014'),
 (8, 2, "Nike Men's Vapor Carbon Elite TD Football Cle", '', 129.99, 'http://images.acmesports.sports/Nike+Men%27s+Vapor+Carbon+Elite+TD+Football+Cleat'),
 (9, 2, 'Nike Adult Vapor Jet 3.0 Receiver Gloves', '', 50.0, 'http://images.acmesports.sports/Nike+Adult+Vapor+Jet+3.0+Receiver+Gloves'),
 (10, 2, "Under Armour Men's Highlight MC Football Clea", '', 129.99, 'http://images.acmesports.sports/Under+Armour+Men%27s+Highlight+MC+Football+Cleat')]

In [6]:
%sql SELECT count(1) FROM orders

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(68883,)]

In [7]:
%sql SELECT count(1) FROM order_items

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(172198,)]

In [8]:
%sql SELECT count(1) FROM products

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(1345,)]

In [9]:
%%sql 

SELECT order_customer_id, order_date, order_status 
FROM orders 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(11599, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED'),
 (256, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT'),
 (12111, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (8827, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED'),
 (11318, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (7130, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (4530, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE'),
 (2911, datetime.datetime(2013, 7, 25, 0, 0), 'PROCESSING'),
 (5657, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT'),
 (5648, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT')]

In [11]:
%%sql 

SELECT order_customer_id, 
    to_char(order_date, 'yyyy-MM-dd'), 
    order_status 
FROM orders 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(11599, '2013-07-25', 'CLOSED'),
 (256, '2013-07-25', 'PENDING_PAYMENT'),
 (12111, '2013-07-25', 'COMPLETE'),
 (8827, '2013-07-25', 'CLOSED'),
 (11318, '2013-07-25', 'COMPLETE'),
 (7130, '2013-07-25', 'COMPLETE'),
 (4530, '2013-07-25', 'COMPLETE'),
 (2911, '2013-07-25', 'PROCESSING'),
 (5657, '2013-07-25', 'PENDING_PAYMENT'),
 (5648, '2013-07-25', 'PENDING_PAYMENT')]

In [12]:
%%sql 

SELECT order_customer_id, 
    to_char(order_date, 'yyyy-MM'), 
    order_status 
FROM orders 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(11599, '2013-07', 'CLOSED'),
 (256, '2013-07', 'PENDING_PAYMENT'),
 (12111, '2013-07', 'COMPLETE'),
 (8827, '2013-07', 'CLOSED'),
 (11318, '2013-07', 'COMPLETE'),
 (7130, '2013-07', 'COMPLETE'),
 (4530, '2013-07', 'COMPLETE'),
 (2911, '2013-07', 'PROCESSING'),
 (5657, '2013-07', 'PENDING_PAYMENT'),
 (5648, '2013-07', 'PENDING_PAYMENT')]

In [14]:
%%sql 

SELECT order_customer_id, 
    to_char(order_date, 'yyyy-MM') AS order_month, 
    order_status 
FROM orders 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(11599, '2013-07', 'CLOSED'),
 (256, '2013-07', 'PENDING_PAYMENT'),
 (12111, '2013-07', 'COMPLETE'),
 (8827, '2013-07', 'CLOSED'),
 (11318, '2013-07', 'COMPLETE'),
 (7130, '2013-07', 'COMPLETE'),
 (4530, '2013-07', 'COMPLETE'),
 (2911, '2013-07', 'PROCESSING'),
 (5657, '2013-07', 'PENDING_PAYMENT'),
 (5648, '2013-07', 'PENDING_PAYMENT')]

In [15]:
%%sql 

SELECT count(DISTINCT to_char(order_date, 'yyyy-MM')) AS distinct_month_count 
FROM orders

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(13,)]

## Filtering Data

Let us understand how we can filter the data as part of our queries.

* We use `WHERE` clause to filter the data.
* All comparison operators such as `=`, `!=`, `>`, `<`, `<=`, `>=` etc can be used to compare a column or expression or literal with another column or expression or literal.
* We can use operators such as `LIKE` with `%` or `~` with regular expressions for pattern matching.
* Boolean `OR` and `AND` can be performed when we want to apply multiple conditions.
  * Get all orders with order_status equals to COMPLETE or CLOSED. We can also use IN operator.
  * Get all orders from month 2014 January with order_status equals to COMPLETE or CLOSED
* We can also use `BETWEEN` along with `AND` to compare a column or expression against range of values.
* We need to use `IS NULL` and `IS NOT NULL` to compare against null values.

In [22]:
%%sql 

SELECT * FROM orders 
WHERE order_status = 'COMPLETE' 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 333, 'COMPLETE'),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 7562, 'COMPLETE'),
 (28, datetime.datetime(2013, 7, 25, 0, 0), 656, 'COMPLETE'),
 (32, datetime.datetime(2013, 7, 25, 0, 0), 3960, 'COMPLETE')]

In [23]:
%sql SELECT count(1) FROM orders

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(68883,)]

In [24]:
%%sql 

SELECT count(1)
FROM orders
WHERE order_status = 'COMPLETE'

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(22899,)]

In [27]:
%%sql

SELECT DISTINCT order_status
FROM orders

 * postgresql://postgres:***@localhost:5432/retail_db
9 rows affected.

[('COMPLETE',),
 ('ON_HOLD',),
 ('PENDING_PAYMENT',),
 ('PENDING',),
 ('CLOSED',),
 ('CANCELED',),
 ('PROCESSING',),
 ('PAYMENT_REVIEW',),
 ('SUSPECTED_FRAUD',)]

In [28]:
%%sql 

SELECT * FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED') 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [31]:
%%sql 

SELECT count(1) FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED') 
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(30455,)]

In [34]:
%%sql 

SELECT * FROM orders 
WHERE order_status = 'COMPLETE' OR order_status = 'CLOSED'
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (12, datetime.datetime(2013, 7, 25, 0, 0), 1837, 'CLOSED'),
 (15, datetime.datetime(2013, 7, 25, 0, 0), 2568, 'COMPLETE'),
 (17, datetime.datetime(2013, 7, 25, 0, 0), 2667, 'COMPLETE'),
 (18, datetime.datetime(2013, 7, 25, 0, 0), 1205, 'CLOSED')]

In [32]:
%%sql 

SELECT count(1) FROM orders 
WHERE order_status = 'COMPLETE' OR order_status = 'CLOSED'

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(30455,)]

In [41]:
%%sql

SELECT * FROM orders
WHERE order_date = '2014-04-01'
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(40468, datetime.datetime(2014, 4, 1, 0, 0), 11251, 'ON_HOLD'),
 (40469, datetime.datetime(2014, 4, 1, 0, 0), 207, 'PROCESSING'),
 (40470, datetime.datetime(2014, 4, 1, 0, 0), 12223, 'PENDING_PAYMENT'),
 (40471, datetime.datetime(2014, 4, 1, 0, 0), 8847, 'ON_HOLD'),
 (40472, datetime.datetime(2014, 4, 1, 0, 0), 3697, 'PENDING_PAYMENT'),
 (40473, datetime.datetime(2014, 4, 1, 0, 0), 1466, 'COMPLETE'),
 (40474, datetime.datetime(2014, 4, 1, 0, 0), 2734, 'PENDING_PAYMENT'),
 (40475, datetime.datetime(2014, 4, 1, 0, 0), 653, 'COMPLETE'),
 (40476, datetime.datetime(2014, 4, 1, 0, 0), 4313, 'PENDING'),
 (40477, datetime.datetime(2014, 4, 1, 0, 0), 4080, 'CLOSED')]

In [43]:
%%sql

SELECT * FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM-dd') LIKE '2014-01%'
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 4598, 'COMPLETE'),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 6735, 'COMPLETE'),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 10045, 'COMPLETE'),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 3037, 'CLOSED'),
 (25895, datetime.datetime(2014, 1, 1, 0, 0), 1044, 'COMPLETE'),
 (25897, datetime.datetime(2014, 1, 1, 0, 0), 6405, 'COMPLETE'),
 (25898, datetime.datetime(2014, 1, 1, 0, 0), 3950, 'COMPLETE'),
 (25899, datetime.datetime(2014, 1, 1, 0, 0), 8068, 'CLOSED'),
 (25900, datetime.datetime(2014, 1, 1, 0, 0), 2382, 'CLOSED'),
 (25901, datetime.datetime(2014, 1, 1, 0, 0), 3099, 'COMPLETE')]

In [45]:
%%sql
SELECT count(1) FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM-dd') LIKE '2014-01%'

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(2544,)]

In [49]:
%%sql

SELECT * FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-07'
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(54004, datetime.datetime(2014, 7, 1, 0, 0), 7079, 'COMPLETE'),
 (54007, datetime.datetime(2014, 7, 1, 0, 0), 11772, 'CLOSED'),
 (54009, datetime.datetime(2014, 7, 1, 0, 0), 3971, 'COMPLETE'),
 (54010, datetime.datetime(2014, 7, 1, 0, 0), 4812, 'COMPLETE'),
 (54015, datetime.datetime(2014, 7, 1, 0, 0), 11402, 'COMPLETE'),
 (54016, datetime.datetime(2014, 7, 1, 0, 0), 11211, 'COMPLETE'),
 (54017, datetime.datetime(2014, 7, 1, 0, 0), 6267, 'COMPLETE'),
 (54018, datetime.datetime(2014, 7, 1, 0, 0), 4034, 'CLOSED'),
 (54020, datetime.datetime(2014, 7, 1, 0, 0), 3175, 'CLOSED'),
 (54024, datetime.datetime(2014, 7, 1, 0, 0), 3906, 'COMPLETE')]

In [50]:
%%sql

SELECT count(1) FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM-dd') ~ '2014-01'

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(2544,)]

In [52]:
%%sql

SELECT count(1), min(order_date), max(order_date), count(DISTINCT order_date) 
FROM orders 
WHERE order_status IN ('COMPLETE', 'CLOSED')
    AND order_date BETWEEN '2014-01-01' AND '2014-03-31'

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(7594, datetime.datetime(2014, 1, 1, 0, 0), datetime.datetime(2014, 3, 31, 0, 0), 89)]

In [53]:
%%sql

SELECT DISTINCT order_date
FROM orders
WHERE to_char(order_date, 'yyyy-MM') LIKE '2014-03%'
ORDER BY order_date

 * postgresql://postgres:***@localhost:5432/retail_db
30 rows affected.

[(datetime.datetime(2014, 3, 1, 0, 0),),
 (datetime.datetime(2014, 3, 2, 0, 0),),
 (datetime.datetime(2014, 3, 3, 0, 0),),
 (datetime.datetime(2014, 3, 4, 0, 0),),
 (datetime.datetime(2014, 3, 5, 0, 0),),
 (datetime.datetime(2014, 3, 6, 0, 0),),
 (datetime.datetime(2014, 3, 7, 0, 0),),
 (datetime.datetime(2014, 3, 8, 0, 0),),
 (datetime.datetime(2014, 3, 10, 0, 0),),
 (datetime.datetime(2014, 3, 11, 0, 0),),
 (datetime.datetime(2014, 3, 12, 0, 0),),
 (datetime.datetime(2014, 3, 13, 0, 0),),
 (datetime.datetime(2014, 3, 14, 0, 0),),
 (datetime.datetime(2014, 3, 15, 0, 0),),
 (datetime.datetime(2014, 3, 16, 0, 0),),
 (datetime.datetime(2014, 3, 17, 0, 0),),
 (datetime.datetime(2014, 3, 18, 0, 0),),
 (datetime.datetime(2014, 3, 19, 0, 0),),
 (datetime.datetime(2014, 3, 20, 0, 0),),
 (datetime.datetime(2014, 3, 21, 0, 0),),
 (datetime.datetime(2014, 3, 22, 0, 0),),
 (datetime.datetime(2014, 3, 23, 0, 0),),
 (datetime.datetime(2014, 3, 24, 0, 0),),
 (datetime.datetime(2014, 3, 25, 0, 0),),
 (datetime.datetime(2014, 3, 26, 0, 0),),
 (datetime.datetime(2014, 3, 27, 0, 0),),
 (datetime.datetime(2014, 3, 28, 0, 0),),
 (datetime.datetime(2014, 3, 29, 0, 0),),
 (datetime.datetime(2014, 3, 30, 0, 0),),
 (datetime.datetime(2014, 3, 31, 0, 0),)]

In [56]:
%%sql

DROP TABLE IF EXISTS users;



CREATE TABLE users (
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30) NOT NULL,
    user_last_name VARCHAR(30) NOT NULL,
    user_email_id VARCHAR(50) NOT NULL,
    user_email_validated BOOLEAN DEFAULT FALSE,
    user_password VARCHAR(200),
    user_role VARCHAR(1) NOT NULL DEFAULT 'U', --U and A
    is_active BOOLEAN DEFAULT FALSE,
    create_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    last_updated_ts TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

INSERT INTO users (user_first_name, user_last_name, user_email_id)
VALUES ('Donald', 'Duck', 'donald@duck.com');

INSERT INTO users (user_first_name, user_last_name, user_email_id, user_role, is_active)
VALUES ('Mickey', 'Mouse', 'mickey@mouse.com', 'U', true);

INSERT INTO users 
    (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true);
    

SELECT * FROM users;

 * postgresql://postgres:***@localhost:5432/retail_db
Done.
Done.
1 rows affected.
1 rows affected.
3 rows affected.
5 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 12, 22, 18, 50, 31, 915790), datetime.datetime(2022, 12, 22, 18, 50, 31, 915790)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 918128), datetime.datetime(2022, 12, 22, 18, 50, 31, 918128)),
 (3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 921105), datetime.datetime(2022, 12, 22, 18, 50, 31, 921105)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 921105), datetime.datetime(2022, 12, 22, 18, 50, 31, 921105)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 921105), datetime.datetime(2022, 12, 22, 18, 50, 31, 921105))]

In [57]:
%%sql

SELECT * FROM users
WHERE user_password = NULL

 * postgresql://postgres:***@localhost:5432/retail_db
0 rows affected.

[]

In [58]:
%%sql

SELECT * FROM users
WHERE user_password IS NULL

 * postgresql://postgres:***@localhost:5432/retail_db
2 rows affected.

[(1, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2022, 12, 22, 18, 50, 31, 915790), datetime.datetime(2022, 12, 22, 18, 50, 31, 915790)),
 (2, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 918128), datetime.datetime(2022, 12, 22, 18, 50, 31, 918128))]

In [59]:
%%sql

SELECT * FROM users
WHERE user_password IS NOT NULL

 * postgresql://postgres:***@localhost:5432/retail_db
3 rows affected.

[(3, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 921105), datetime.datetime(2022, 12, 22, 18, 50, 31, 921105)),
 (4, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 921105), datetime.datetime(2022, 12, 22, 18, 50, 31, 921105)),
 (5, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2022, 12, 22, 18, 50, 31, 921105), datetime.datetime(2022, 12, 22, 18, 50, 31, 921105))]

## Joining Tables  Inner

Let us understand how to join data from multiple tables.

* We will primarily focus on ANSI style join (**JOIN with ON**).
* There are different types of joins.
  * INNER JOIN - Get all the records from both the datasets which satisfies JOIN condition.
  * OUTER JOIN - We will get into the details as part of the next topic
* Example for INNER JOIN

```sql
SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
LIMIT 10
```

* We can join more than 2 tables in one query. Here is how it will look like.

```sql
SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
    JOIN products p
    ON p.product_id = oi.order_item_product_id
LIMIT 10
```

* If we have to apply additional filters, it is recommended to use WHERE clause. ON clause should only have join conditions.
* We can have non equal join conditions as well, but they are not used that often.
* Here are some of the examples for INNER JOIN:
  * Get order id, date, status and item revenue for all order items.
  * Get order id, date, status and item revenue for all order items for all orders where order status is either COMPLETE or CLOSED.
  * Get order id, date, status and item revenue for all order items for all orders where order status is either COMPLETE or CLOSED for the orders that are placed in the month of 2014 January.

In [60]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95)]

In [61]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 99.96),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 129.99)]

In [62]:
%%sql

SELECT count(1)
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(75408,)]

In [63]:
%%sql

SELECT o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.97),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 100.0),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 79.98),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 399.98),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.98),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 99.96),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 19.99),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 150.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 50.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 119.97)]

In [64]:
%%sql

SELECT count(1)
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 10

 * postgresql://postgres:***@localhost:5432/retail_db
1 rows affected.

[(6198,)]